brew 'bat'
brew 'bitwarden-cli'
brew 'coreutils'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'go'
brew 'jq'
brew 'mas'
brew 'mise'
brew 'neovim'
brew 'netcat'
brew 'nmap'
brew 'rg'
brew 'shellcheck'
brew 'stylua'
brew 'telnet'
brew 'tmux'
brew 'typst'
brew 'typstyle'
brew 'uv'
brew 'vim'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

brew 'basedpyright'
brew 'bash-language-server'
brew 'docker-compose-langserver'
brew 'dockerfile-language-server'
brew 'golangci-lint-langserver'
brew 'gopls'
brew 'lua-language-server'
brew 'tailwindcss-language-server'
brew 'tinymist'
brew 'tombi'
brew 'tree-sitter-cli'
brew 'typescript-language-server'
brew 'vscode-langservers-extracted'

cask 'brave-browser'
cask 'docker-desktop'
cask 'ghostty'
cask 'macfuse'
cask 'mullvad-browser'
cask 'postico'
cask 'pycharm'
cask 'raycast'
cask 'tailscale-app'
cask 'utm'
cask 'veracrypt'

mas 'Bitwarden', id: 1352778147
