# https://github.com/driesvints/dotfiles/blob/main/Brewfile
tap 'homebrew/cask'

# https://github.com/pyenv/pyenv/wiki#suggested-build-environment
brew 'openssl'
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'zlib'
brew 'tcl-tk'

# Binaries
brew 'bat'
brew 'coreutils'
brew 'fzf'
brew 'htop'
brew 'gcc'
brew 'git'
brew 'jq'
brew 'make'
brew 'mas'
brew 'neofetch'
brew 'netcat'
brew 'nmap'
brew 'pyenv'
brew 'ripgrep'
brew 'shpotify'
brew 'texlive'
brew 'tree'
brew 'vim'
brew 'zoxide'
brew 'zsh'
brew 'zsh-syntax-highlighting'

# Apps
cask 'authy'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'microsoft-word'
cask 'pycharm'
cask 'raspberry-pi-imager'
cask 'spotify'
cask 'utm'
cask 'visual-studio-code'
cask 'zoom'

mas 'Xcode', id: 497799835
mas 'Bitwarden', id: 1352778147
