# https://github.com/driesvints/dotfiles/blob/main/Brewfile
tap 'homebrew/cask'

# Binaries
brew 'bat'
brew 'bitwarden-cli'
brew 'coreutils'
brew 'fd'
brew 'fzf'
brew 'gcc'
brew 'git'
brew 'go'
brew 'goose'
brew 'jq'
brew 'make'
brew 'mas'
brew 'neovim'
brew 'netcat'
brew 'nmap'
brew 'rg'
brew 'shellcheck'
brew 'shpotify'
brew 'stylua'
brew 'telnet'
brew 'texlive'
brew 'tmux'
brew 'tree'
brew 'uv'
brew 'vim'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# lsp
brew 'basedpyright'
brew 'bash-language-server'
brew 'dockerfile-language-server'
brew 'lua-language-server'
brew 'ruff'
brew 'tailwindcss'
brew 'templ'
brew 'typescript-language-server'
brew 'vscode-langservers-extracted'

# Apps
# cask 'bitwarden'
cask 'brave-browser'
cask 'docker'
cask 'ghostty'
cask 'iterm2'
cask 'ivpn'
cask 'macfuse'
cask 'mullvad-browser'
cask 'mullvadvpn'
cask 'postico'
cask 'pycharm'
cask 'raycast'
cask 'utm'
cask 'veracrypt'

mas 'Bitwarden', id: 1352778147
