# https://github.com/driesvints/dotfiles/blob/main/Brewfile
tap 'homebrew/cask'

# https://github.com/pyenv/pyenv/wiki#suggested-build-environment
brew 'openssl'
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'zlib'
brew 'tcl-tk'

# Binaries
brew 'bat'
brew 'bitwarden-cli'
brew 'coreutils'
brew 'fd'
brew 'fzf'
brew 'gcc'
brew 'git'
brew 'go'
brew 'goose'
brew 'jq'
brew 'make'
brew 'mas'
brew 'neofetch'
brew 'neovim'
brew 'netcat'
brew 'nmap'
brew 'pyenv'
brew 'rg'
brew 'shellcheck'
brew 'shpotify'
brew 'stylua'
brew 'telnet'
brew 'texlive'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'zoxide'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Apps
# cask 'bitwarden'
cask 'brave-browser'
cask 'docker'
cask 'iterm2'
cask 'ivpn'
cask 'macfuse'
cask 'postico'
cask 'pycharm'
cask 'utm'
cask 'veracrypt'
cask 'visual-studio-code'

mas 'Xcode', id: 497799835
mas 'Bitwarden', id: 1352778147
